{
  "questions": [
    {
      "question": "Which technologies have been used?",
      "response": "For this website that works as a portfolio, we have chosen to use React TypeScript + Vite, personally I like to use more Vite than Create React App for its simplified structure, we have also chosen to use TypeScript because I personally like it more than JavaScript for its structure and the obligation to have it all typed."
    },
    {
      "question": "How is multilanguage achieved?",
      "response": "In order to create a translation functionality we have chosen to use the i18next technology for react, which makes it much easier to have the texts ordered and with total freedom. For this web page we have used several text files in JSON format, better explained in the next question."
    },
    {
      "question": "How is information obtained?",
      "response": "To avoid having to modify the components to update the information, we have extracted the information in several JSON files, so we have a direct access to the information and the information shown in the components is simply dynamic data, we have also duplicated all the files to have two versions, both in English and Spanish."
    },
    {
      "question": "How are images stored?",
      "response": "Currently the images to reduce weight and speed up the screens are uploaded to a Google Firebase Storage CDN."
    },
    {
      "question": "Where did you get the design? Who made it?",
      "response": "The design is 100% mine, as you can see in the link to Figma on the top right, this design I have created thanks to the knowledge I have about the handling of the Figma tool as well as the notions I learned in the UI/UX Design course I took."
    },
    {
      "question": "How do you deploy the site?",
      "response": "I am currently using Netlify and the way to deploy is through the repository, I am actually deploying the master branch and every time I do a push to that branch it is updated in Netlify."
    },
    {
      "question": "Do you have any control over website traffic?",
      "response": "It is currently linked to Firebase where Google Analytics is used to monitor traffic and key actions."
    }
  ],
  "figma": "https://www.figma.com/file/unFuvoE1cc4cBu4JScaeTA/Portfolio?type=design&node-id=0%3A1&mode=design&t=bfuUfCcgHfOAqL3g-1",
  "github": "https://github.com/D1f3r3nt/Portfolio"
}