{
  "header": {
    "home": "Who I am",
    "apps": "Applications",
    "studies": "Degree",
    "experience": "Career",
    "about": "About this page"
  },
  "home": {
    "name": "Marc Santisteban Ruiz",
    "description": "Fullstack developer, I am currently working in Arteco Consulting and I have almost a year of experience in this company.\nyear of experience in this company, I have more than 4 years of experience programming individually.\nindividually, I have worked with several technologies but the one I work with the most is with\nJava and React.js. Able to work in a team or independently, depending on the needs, willing to learn and\nI am eager to learn and eager to improve.\n\nI am currently attending a bootcamp of fullstack mobile, because at the end I would like to evolve towards a fullstack mobile profile.\nevolve towards a profile of fullstack mobile (IOS / Android), with knowledge in React\nNative, Flutter, Swift and Kotlin.\n\nFor more information feel free to visit my website, where I upload my personal projects (along with its Github), my knowledge, etc.",
    "location": "Palma de Mallorca, España",
    "birthday": "03/10/2003",
    "languages": "English & Spanish",
    "gmail": "santistebanmarc@gmail.com",
    "phone": "+34 693 49 31 11",
    "linkedinURL": "https://www.linkedin.com/in/marc-santisteban-ruiz/",
    "githubURL": "https://github.com/D1f3r3nt?tab=repositories",
    "stackOverflowURL": "https://stackoverflow.com/users/22357684/marc-santisteban"
  },
  "studies": {
    "degree": [
      {
        "title": "High School Diploma with a Science Emphasis",
        "date": "09/2019 - 06/2021",
        "description": "I studied at IES S'Arenal where I took the scientific baccalaureate. During my time there, I developed solid skills in JavaScript, Java, MySQL, CSS and HTML. I acquired these competencies through internships, exams and assignments that challenged my understanding and skills in programming and web design. These experiences enriched my education and prepared me to face the challenges of the technological world with confidence and skill."
      },
      {
        "title": "Associate Degree of Development of Multiplatform Applications",
        "date": "09/2021 - 06/2023",
        "description": "I studied at CIFP Pau Casesnoves the Higher Degree in Multiplatform Application Development, where I acquired skills in Flutter, Linux, Git and GitHub, Dart, MongoDB and Java. I developed these skills through internships, exams and projects, where I obtained a final average of 9.7. Thanks to this training, I feel able to face challenges in the world of software development with solidity and confidence."
      },
      {
        "title": "Full Stack Mobile App Development Bootcamp",
        "date": "01/2023 - 04/2024",
        "description": "KeepCoding's Full Stack Mobile Bootcamp provides a complete mastery of the main components and architectures of the mobile stack, training at an advanced level in native Swift, native Kotlin, React Native and Flutter."
      }
    ]
  }
}