{
  "name": "Marc Santisteban Ruiz",
  "description": "My name is Marc Santisteban Ruiz and I am 20 years old.\n\n\nI'm currently working as a Fullstack Developer in a consultancy, where I provide IT\nsolutions to the hotel chain Melia. In this job I work with SpringBoot (Java)\ntechnologies in backend and ReactTS (TypeScript) in frontend.\n\n\nI consider myself a person in love with programming, to such an extent that today I\nam still training in native app development with SwiftUI (iOS) and Jetpack Compose\n(Android), this eagerness for programming has led me to develop a lot of projects\n(iOS, Android, Web or Backend) and to touch technologies that are not so focused on\nprogramming, such as Docker, Kubernetes, AWS, Google Cloud, Firebase, Jira,\nBitbucket, Google Analytics, among others.\n\n\nDue to all the problems that have been arising in my projects I have been learning\ndifferent techniques to facilitate the scalability of a project, for example, SCRUM and\nKanban methodologies for the development of projects, SOLID principles to develop\nsecure and scalable code, use of Jira as it facilitates the creation of branches to\ndevelop tasks, creation of testing to ensure that no previously created logic is broken\nand creation of documentation to easily understand code fragments.\n\n\nPersonally I am a person with people skills and leadership ability, as I always look to\nreach a point where everyone is comfortable, I am also a responsible person,\nefficient, always looking for perfection in terms of development, I like and always\nlook for constructive criticism and I consider myself a fighter as I always strive to the\nmaximum to achieve my goals.\n\n\nNowadays, I am looking for opportunities abroad, to develop and develop outside my\ncomfort zone, also to get to know the culture of other countries and to learn from\npeople, because as I mentioned before, criticism is the best feedback to grow.",
  "location": "Palma de Mallorca, España",
  "birthday": "03/10/2003",
  "languages": "English & Spanish",
  "gmail": "santistebanmarc@gmail.com",
  "phone": "+34 693 49 31 11",
  "linkedinURL": "https://www.linkedin.com/in/marc-santisteban-ruiz/",
  "githubURL": "https://github.com/D1f3r3nt?tab=repositories",
  "stackOverflowURL": "https://stackoverflow.com/users/22357684/marc-santisteban"
}