{
  "degree": [
    {
      "title": "High School Diploma with Physical Sciences",
      "date": "09/2019 - 06/2021",
      "description": "I studied at IES S'Arenal where I took the scientific baccalaureate. During my time there, I developed solid skills in JavaScript, Java, MySQL, CSS and HTML. I acquired these competencies through internships, exams and assignments that challenged my understanding and skills in programming and web design. These experiences enriched my education and prepared me to face the challenges of the technological world with confidence and skill."
    },
    {
      "title": "Associate Degree of Multiplatform Applications Development",
      "date": "09/2021 - 06/2023",
      "description": "I studied at CIFP Pau Casesnoves the Higher Degree in Multiplatform Application Development, where I acquired skills in Flutter, Linux, Git and GitHub, Dart, MongoDB and Java. I developed these skills through internships, exams and projects, where I obtained a final average of 9.7. Thanks to this training, I feel able to face challenges in the world of software development with solidity and confidence."
    },
    {
      "title": "Full Stack Mobile App Development Bootcamp",
      "date": "01/2023 - 04/2024",
      "description": "KeepCoding's Full Stack Mobile Bootcamp provides a complete mastery of the main components and architectures of the mobile stack, training at an advanced level in native Swift, native Kotlin, React Native and Flutter."
    }
  ],
  "course": [
    {
      "title": "Introduction to Web Development I",
      "date": "04/2021",
      "description": "In this course held at Google, I learned the basics of web development, learning skills such as basic HTML and basic CSS.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_introduccion_al_desarrollo_web_1.png?alt=media&token=5a86748c-ed0e-40d6-84f9-929999c634cb"
    },
    {
      "title": "Mobile Apps Development",
      "date": "06/2021",
      "description": "In this course held at Google, I learned the basics of mobile app development, learning skills such as Android and iOS operating systems, application deployment on Google Play and mobile marketing and monetization avenues.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_desarrollo_de_apps_moviles.png?alt=media&token=3800911d-0c42-42ac-b33c-5bbad5f9e7fc"
    },
    {
      "title": "AWS Cloud Particioner Essentials",
      "date": "12/2021",
      "description": "In this course on Amazon Web Service, I learned the basics of how to set up a server, the different types of services offered by AWS and the ways to upload applications to AWS.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2FAWS_course_cloud_particioner.png?alt=media&token=a73797d9-283c-488d-af14-951b63c60273"
    },
    {
      "title": "Introduction to Web Development II",
      "date": "07/2022",
      "description": "In this course held at Google, I continued learning the basics of web development, learning skills such as advanced HTML, advanced CSS and Bootstrap.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_introduccion_al_desarrollo_web_2.png?alt=media&token=5e33727e-bb8a-4eb3-bb3c-0d16aca90ae4"
    },
    {
      "title": "Google Cloud Computing",
      "date": "09/2022",
      "description": "In this course held at Google, I learned the basics of how to set up a server, the different types of services offered by Google and the ways to upload and deploy applications in Google Cloud.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_cloud_computing.png?alt=media&token=4bc6adcb-6348-4af1-b405-741660e3578f"
    },
    {
      "title": "Kotlin",
      "date": "03/2023",
      "description": "In this course held at KeepCoding, I learned both the basics and advanced techniques of Kotlin programming.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcurso_de_kotlin_desde_cero.png?alt=media&token=ae60efbf-1584-4966-b9ed-d9e9cda4e80f"
    },
    {
      "title": "Docker for developers",
      "date": "03/2023",
      "description": "In this course held at OpenWebinars, I learned the principles of Docker as well as how to create Dockerfiles or docker-compose.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcurso_de_docker.png?alt=media&token=ee51c251-2c1f-4035-a4f4-8463351f933b"
    },
    {
      "title": "UI/UX Design",
      "date": "09/2023",
      "description": "Thanks to the follow up of KeepCoding's Mobile App Development Bootcamp I have managed to obtain the UI/UX design certificate, where I have learned current UI/UX techniques, as now can be standards of IOS and Android design, future techniques such as Neomorphism.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2FUI_UX.png?alt=media&token=aa1bceea-b30d-4fc6-88c1-fc91701bd2a9"
    },
    {
      "title": "Swift",
      "date": "09/2023",
      "description": "Thanks to the follow-up of KeepCoding's Mobile App Development Bootcamp, I managed to obtain the Swift programming certificate, where I learned both the basic notions and advanced techniques of Swift programming.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fswift.png?alt=media&token=be446f21-f2e1-4f42-a841-7fe60d7775ad"
    },
    {
      "title": "IOS Fundamentals",
      "date": "09/2023",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the IOS Fundamentals certificate, where I have acquired basic knowledge of Storyboard and XIBs development programming in Swift UIKit.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Ffundamentos_IOS.png?alt=media&token=b4424a4a-9a66-4b78-b48f-35228ccbbeb7"
    },
    {
      "title": "Design Patterns",
      "date": "10/2023",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Design Patterns Certificate, where I have acquired the knowledge of the different architectures of the mobile world as well as their characteristics. Starting with the MVC architecture (Model-View-Controller) and then the MVVM architecture (Model-View-ViewModel), most used nowadays.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fpatrones_de_dise%C3%B1o.png?alt=media&token=19ffd24f-0245-496c-b5f5-f2a95338631e"
    },
    {
      "title": "React",
      "date": "10/2023",
      "description": "At Arteco Consulting sl, we were asked to develop our knowledge of frontend programming, specifically in React Javascript + Vite. In this course I have gained knowledge about: React Hooks, Custom hooks, Firebase with React, Deployment in Heroku, Deployment in Netlify, via repository, Redux, OAuth and Material UI.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Freact_de_cero_a_experto.png?alt=media&token=c04e8e52-05d8-4307-9292-f630e19188a3"
    },
    {
      "title": "IOS Advanced",
      "date": "11/2023",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Advanced iOS Certificate, where I learned Apple Maps programming, along with Core Data and Keychain technologies. I also improved my knowledge in XIBs and testing.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_iOS_avanzado.png?alt=media&token=0465f8e2-1501-4761-9989-d468b861a521"
    },
    {
      "title": "Android Fundamentals",
      "date": "12/2023",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Android Fundamentals Certificate, where I learned to develop android applications with XML and Kotlin technology, I also acquired knowledge in testing.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_fundamentos_android.png?alt=media&token=378d12ad-df8d-40b1-b659-69142170cae0"
    },
    {
      "title": "Android Advanced",
      "date": "01/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Android Advanced Certificate, where I learned to develop android applications with XML and Kotlin technology, I also learned to use Shared Preferences to store values locally, Room to create a local database, to implement Google Maps and to use Retrofit to make network calls.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_android_avanzado.png?alt=media&token=3bad79b1-28cc-4762-b05a-d2a24191ebdd"
    },
    {
      "title": "SwiftUI",
      "date": "02/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the SwiftUI Certificate, where I learned to develop iOS applications with SwiftUI technology, and also implemented reactive programming with Combine.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_iOS_swiftUI.png?alt=media&token=aea947bc-8e89-47e9-b6ae-2e8c4fa15fd7"
    },
    {
      "title": "Jetpack Compose",
      "date": "02/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Jetpack Compose Certificate, where I learned to develop android applications with jetcpak compose technology, and also implemented reactive programming with Kotlin Flow and Room.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_android_compose.png?alt=media&token=99579339-58fe-49b1-96e4-bba06a11fa2e"
    },
    {
      "title": "Firebase",
      "date": "02/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Firebase Certificate, where I learned how to use Firebase technology and all its functionalities related to Android and iOS development.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_firebase.png?alt=media&token=21316a22-e864-4a67-b060-bc7fe1fa4ca2"
    },
    {
      "title": "Swift Vapor",
      "date": "03/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Swift Vapor Certificate, where I learned how to use the Swift Vapor technology, which allows us to create a backend that can be easily connected to various services such as Redis or Fluent (to connect to databases).",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_vapor.png?alt=media&token=2cc93ee5-7b94-4bb8-89a7-0e3682f365b9"
    },
    {
      "title": "Deployment iOS & Android",
      "date": "03/2024",
      "description": "Thanks to the follow-up of the Mobile App Development Bootcamp at KeepCoding, I have obtained the Deployment iOS & Android Certificate, where I learned how to deploy applications for both Android on Google Play and iOS on Apple Store.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_despliegue_android_y_iOS.png?alt=media&token=2b17112d-ac9b-4355-9da3-15cc4b3f0b1e"
    }
  ]
}