{
  "degree": [
    {
      "title": "Bachillerato científico",
      "date": "09/2019 - 06/2021",
      "description": "Estudié en el IES S'Arenal donde cursé el bachillerato científico. Durante mi tiempo allí, desarrollé habilidades sólidas en JavaScript, Java, MySQL, CSS y HTML. Adquirí estas competencias a través de prácticas, exámenes y trabajos que desafiaron mi comprensión y destreza en programación y diseño web. Estas experiencias enriquecieron mi formación y me prepararon para enfrentar los desafíos del mundo tecnológico con confianza y habilidad."
    },
    {
      "title": "Grado superior de Desarrollo de Aplicaciones Multiplataforma",
      "date": "09/2021 - 06/2023",
      "description": "Estudié en el CIFP Pau Casesnoves el Grado Superior de Desarrollo de Aplicaciones Multiplataforma, donde adquirí habilidades en Flutter, Linux, Git y GitHub, Dart, MongoDB y Java. Estas competencias las desarrollé a través de prácticas, exámenes y proyectos, donde obtuve una media final de 9,7. Gracias a esta formación, me siento capacitado para enfrentar desafíos en el mundo del desarrollo de software con solidez y confianza."
    },
    {
      "title": "Desarrollo de Apps Móviles Full Stack Bootcamp",
      "date": "01/2023 - 04/2024",
      "description": "El Bootcamp Full Stack Mobile de KeepCoding proporciona un dominio completo de los principales componentes y arquitecturas del stack mobile, formando a nivel avanzado en Swift nativo, Kotlin nativo, React Native y Flutter."
    }
  ],
  "course": [
    {
      "title": "Introducción al Desarrollor Web I",
      "date": "04/2021",
      "description": "En este curso realizado en Google, aprendí las nociones básicas del desarrollo web, aprendiendo aptitudes como HTML básico y CSS básico",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_introduccion_al_desarrollo_web_1.png?alt=media&token=5a86748c-ed0e-40d6-84f9-929999c634cb"
    },
    {
      "title": "Desarrollo de Apps Móviles",
      "date": "06/2021",
      "description": "En este curso realizado en Google, aprendí las nociones básicas del desarrollo de apps móviles, aprendiendo aptitudes como Sistema operativo Android y iOS, despligue de aplicaciones en Google Play y vias de marketing y monetización en móviles",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_desarrollo_de_apps_moviles.png?alt=media&token=3800911d-0c42-42ac-b33c-5bbad5f9e7fc"
    },
    {
      "title": "AWS Cloud Particioner Essentials",
      "date": "12/2021",
      "description": "En este curso realizado en Amazon Web Service, aprendí las nociones básicas de como configurar un servidor, los diferentes tipos de servicios que ofrece AWS y las formas de subir desplegar aplicaciones en AWS",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2FAWS_course_cloud_particioner.png?alt=media&token=a73797d9-283c-488d-af14-951b63c60273"
    },
    {
      "title": "Introducción al Desarrollor Web II",
      "date": "07/2022",
      "description": "En este curso realizado en Google, segui aprendiendo las nociones básicas del desarrollo web, aprendiendo aptitudes como HTML avanzado, CSS avanzado y Bootstrap",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_introduccion_al_desarrollo_web_2.png?alt=media&token=5e33727e-bb8a-4eb3-bb3c-0d16aca90ae4"
    },
    {
      "title": "Google Cloud Computing",
      "date": "09/2022",
      "description": "En este curso realizado en Google, aprendí las nociones básicas de como configurar un servidor, los diferentes tipos de servicios que ofrece Google y las formas de subir desplegar aplicaciones en Google Cloud",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fgoogle_cloud_computing.png?alt=media&token=4bc6adcb-6348-4af1-b405-741660e3578f"
    },
    {
      "title": "Kotlin",
      "date": "03/2023",
      "description": "En este curso realizado en KeepCoding, aprendí tanto las nociones básica, como tecnicas avanzadas de la programación en Kotlin",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcurso_de_kotlin_desde_cero.png?alt=media&token=ae60efbf-1584-4966-b9ed-d9e9cda4e80f"
    },
    {
      "title": "Docker para desarrolladores",
      "date": "03/2023",
      "description": "En este curso realizado en OpenWebinars, aprendí los principios de Docker asi como crear Dockerfiles o docker-compose",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcurso_de_docker.png?alt=media&token=ee51c251-2c1f-4035-a4f4-8463351f933b"
    },
    {
      "title": "Diseño UI/UX",
      "date": "09/2023",
      "description": "Gracias al seguimiento del Bootcamp de Desarrollo de Apps Móviles de KeepCoding he conseguido obtener el certificado de diseño UI/UX, donde he aprendido técnicas actuales de UI/UX, como ahora pueden ser estándares del diseño IOS y Android, futuras técnicas como el Neomorfismo",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2FUI_UX.png?alt=media&token=aa1bceea-b30d-4fc6-88c1-fc91701bd2a9"
    },
    {
      "title": "Swift",
      "date": "09/2023",
      "description": "Gracias al seguimiento del Bootcamp de Desarrollo de Apps Móviles de KeepCoding he conseguido obtener el certificado de programación en Swift, donde aprendí tanto las nociones básica, como tecnicas avanzadas de la programación en Swift",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fswift.png?alt=media&token=be446f21-f2e1-4f42-a841-7fe60d7775ad"
    },
    {
      "title": "Fundamentos de IOS",
      "date": "09/2023",
      "description": "Gracias al seguimiento del Bootcampo de Desarrollo de Apps Móviles en KeepCoding, he obtenido el certificado de Fundamentos IOS, donde he adquirido conociemiento basico de desarrollo en Storyboard y XIBs programando en Swift UIKit",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Ffundamentos_IOS.png?alt=media&token=b4424a4a-9a66-4b78-b48f-35228ccbbeb7"
    },
    {
      "title": "Patrones de diseño",
      "date": "10/2023",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Design Patterns Certificate, donde he adquirido el conocimiento de las diferentes arquitecturas del mundo móvil así como sus características. Empezando por la arquitectura MVC (Model-View-Controller) y siguiendo por la arquitectura MVVM (Model-View-ViewModel), más utilizada en la actualidad.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fpatrones_de_dise%C3%B1o.png?alt=media&token=19ffd24f-0245-496c-b5f5-f2a95338631e"
    },
    {
      "title": "React",
      "date": "10/2023",
      "description": "En Arteco Consulting SL nos pidieron desarrollar nuestros conocimientos de frontend programación, concretamente en React Javascript + Vite. En este curso he adquirido conocimientos sobre: React Hooks, Custom hooks, Firebase con React, Deployment en Heroku, Deployment en Netlify, vía repositorio, Redux, OAuth y Material UI.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Freact_de_cero_a_experto.png?alt=media&token=c04e8e52-05d8-4307-9292-f630e19188a3"
    },
    {
      "title": "IOS Avanzado",
      "date": "11/2023",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Advanced iOS Certificate, donde aprendí la programación de Apple Maps, junto con las tecnologías Core Data y Keychain. También mejoré mis conocimientos en XIBs y testing.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_iOS_avanzado.png?alt=media&token=0465f8e2-1501-4761-9989-d468b861a521"
    },
    {
      "title": "Fundamentos de Android",
      "date": "12/2023",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Android Fundamentals Certificate, donde aprendí a desarrollar aplicaciones android con tecnología XML y Kotlin, también adquirí conocimientos en testing.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_fundamentos_android.png?alt=media&token=378d12ad-df8d-40b1-b659-69142170cae0"
    },
    {
      "title": "Android Avanzado",
      "date": "01/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Android Advanced Certificate, donde aprendí a desarrollar aplicaciones android con tecnología XML y Kotlin, también aprendí a utilizar Shared Preferences para almacenar valores localmente, Room para crear una base de datos local, a implementar Google Maps y a utilizar Retrofit para realizar llamadas de red.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_android_avanzado.png?alt=media&token=3bad79b1-28cc-4762-b05a-d2a24191ebdd"
    },
    {
      "title": "SwiftUI",
      "date": "02/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Certificado SwiftUI, donde aprendí a desarrollar aplicaciones iOS con tecnología SwiftUI, y también implementé programación reactiva con Combine.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_iOS_swiftUI.png?alt=media&token=aea947bc-8e89-47e9-b6ae-2e8c4fa15fd7"
    },
    {
      "title": "Jetpack Compose",
      "date": "02/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Jetpack Compose Certificate, donde he aprendido a desarrollar aplicaciones android con la tecnología jetcpak compose, y también he implementado programación reactiva con Kotlin Flow y Room.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_android_compose.png?alt=media&token=99579339-58fe-49b1-96e4-bba06a11fa2e"
    },
    {
      "title": "Firebase",
      "date": "02/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Certificado Firebase, donde aprendí a utilizar la tecnología Firebase y todas sus funcionalidades relacionadas con el desarrollo Android e iOS.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_firebase.png?alt=media&token=21316a22-e864-4a67-b060-bc7fe1fa4ca2"
    },
    {
      "title": "Swift Vapor",
      "date": "03/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Swift Vapor Certificate, donde aprendí a utilizar la tecnología Swift Vapor, que nos permite crear un backend que se puede conectar fácilmente a varios servicios como Redis o Fluent (para conectar con bases de datos).",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_vapor.png?alt=media&token=2cc93ee5-7b94-4bb8-89a7-0e3682f365b9"
    },
    {
      "title": "Despliegue iOS y Android",
      "date": "03/2024",
      "description": "Gracias al seguimiento del Mobile App Development Bootcamp en KeepCoding, he obtenido el Deployment iOS & Android Certificate, donde aprendí a desplegar aplicaciones tanto para Android en Google Play como para iOS en Apple Store.",
      "image": "https://firebasestorage.googleapis.com/v0/b/portfolio-f9add.appspot.com/o/diplomas%2Fcertificado_despliegue_android_y_iOS.png?alt=media&token=2b17112d-ac9b-4355-9da3-15cc4b3f0b1e"
    }
  ]
}